In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

car = pd.Series(['BMW', 'Toyota', 'Honda'])
color = pd.Series(['Red', 'Blue', 'White'])

car_df = pd.DataFrame({"Car Make": car, "Color": color})
car_df

  Car Make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [2]:
var1 = np.random.randn(100)*5 + 20
var1

array([10.3877972 , 23.25466769, 19.49945752, 10.69259763, 12.50916322,
       16.65312769, 24.77876869, 24.24549946, 20.65558714, 22.85258786,
       16.78575993, 13.72202276, 21.94673194, 18.42879909, 16.93121563,
       16.06010085, 23.89192046, 22.06339702, 18.2617401 , 25.03552959,
       22.01172633, 21.21383821, 14.33686381, 18.11377327, 15.99881457,
       20.84598685, 32.4805705 , 19.60690875, 28.08964938, 29.98259206,
       19.3685488 , 18.64821913, 16.88465196, 22.47712213, 22.69351634,
       20.56957594, 21.18127334, 22.83738769, 25.88405176, 24.34963774,
       13.48411271, 23.59263158, 26.21854276, 18.46179901, 12.60182857,
       20.52580301, 22.7575999 , 11.51513371, 17.11366801, 24.35760847,
       21.17894783, 19.41372255, 19.33958013, 15.63429434, 16.52333226,
       26.27397424, 28.37306542, 17.58631737, 14.52040001, 17.508061  ,
       14.36617113, 16.08939052, 31.29283657, 23.5490443 , 23.53687516,
       17.14325351, 20.33609468, 13.30918318, 24.13930433, 14.02004775,
       27.83535441, 20.05582501, 19.90769216, 24.77245658, 17.22314117,
       16.29443594, 26.48023653, 21.76950762, 15.73773101, 21.30509952,
       25.80406738, 13.34839045, 20.07230128, 17.06074895, 24.35622929,
       19.05024833, 22.52646218, 19.501725  , 12.57046195, 21.4179661 ,
       18.62542411, 19.21653594, 16.16650405, 17.7062866 , 27.14907471,
       13.38811746, 13.63699696, 20.63474401, 26.7226138 ,  9.53372691])

In [3]:
var2 = np.random.randn(100)>0
var2

array([False, False, False, False,  True,  True, False,  True,  True,
        True,  True,  True,  True,  True, False, False,  True,  True,
       False, False,  True,  True,  True,  True, False,  True, False,
        True,  True, False,  True,  True, False,  True, False,  True,
       False, False, False,  True, False,  True, False,  True,  True,
        True,  True,  True,  True,  True,  True, False,  True,  True,
        True,  True,  True, False, False,  True, False, False, False,
       False,  True,  True,  True,  True, False,  True,  True, False,
        True, False, False,  True, False,  True,  True,  True,  True,
       False, False,  True, False, False, False,  True, False, False,
        True, False,  True, False, False, False,  True,  True,  True,
        True])

In [4]:
label = ["Temperature", "IceCream Eaten?"]
df = pd.DataFrame({label[0]: var1, label[1]: var2})
df

    Temperature  IceCream Eaten?
0     10.387797            False
1     23.254668            False
2     19.499458            False
3     10.692598            False
4     12.509163             True
..          ...              ...
95    13.388117            False
96    13.636997             True
97    20.634744             True
98    26.722614             True
99     9.533727             True

[100 rows x 2 columns]

In [10]:
df.mean()

Temperature        19.908639
IceCream Eaten?     0.580000
dtype: float64

In [11]:
#Create a df with three variables
#integers from 0 to 10
#their squares
#their logs

var1 = np.arange(0,11)
var2 = var1**2
var3 = np.log(var1)

df = pd.DataFrame({"var1": var1, "var2": var2, "var3": var3})
df

/var/folders/m1/5c_y87rd1qv3kfj2lm3f384h0000gn/T/ipykernel_89450/1446588175.py:8: RuntimeWarning: divide by zero encountered in log
  var3 = np.log(var1)

    var1  var2      var3
0      0     0      -inf
1      1     1  0.000000
2      2     4  0.693147
3      3     9  1.098612
4      4    16  1.386294
5      5    25  1.609438
6      6    36  1.791759
7      7    49  1.945910
8      8    64  2.079442
9      9    81  2.197225
10    10   100  2.302585